/*
LuluIKakSePraviDagaException
С подредената тъга ще се построи дъга.
ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤ__________________________________________ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤ__UUUU___________________UUUU________ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤɭㅤﾉㅤㅤㅤㅤㅤㅤㅤㅤㅤɭㅤﾉㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤااㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤااㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤااㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㄑଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ㅤ0ㅤㅤㅤ0ㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㄑ١ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤЛулуㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㄑ١ㅤㅤㅤㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤиㅤкакㅤсеㅤправиㅤдъгаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤଡ଼ଡ଼١ㅤㅤㅤ__ㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ_________________________________ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ㅤㅤܢㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤހㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤЛуㅤстарателноㅤподреждаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㅤㅤㅤހㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤпроваленитеㅤлюбовиㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤразпилянатаㅤнадеждаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤразрушенитеㅤосновиㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤсㅤподреденатаㅤтъгаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤщеㅤсеㅤпостроиㅤдъгаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤ۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤ۱۱۱۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱۱۱۱۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㅤ۱۱۱۱۱۱۱۱ㅤㅤㅤㅤ۱۱۱۱۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㅤㅤㅤااㅤ۱۱۱۱۱۱۱۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㅤㅤㅤHㅤㅤㅤHㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()

Use the below line of code to call the stack trace art method:
new \u115f\u115f().ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
*/

using System;

namespace StackTraceangelo.DotNet.Art
{ // ReSharper disable CheckNamespace
// ReSharper disable InconsistentNaming
#pragma warning disable 1709 // warning CS1709: Filename specified for preprocessor directive is empty
#line 1 ""
    public class \u115f\u115f
    {
#line 1 ""
        public void ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㅤㅤㅤHㅤㅤㅤHㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㅤㅤㅤHㅤㅤㅤHㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㅤㅤㅤااㅤ۱۱۱۱۱۱۱۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㅤㅤㅤااㅤ۱۱۱۱۱۱۱۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㅤ۱۱۱۱۱۱۱۱ㅤㅤㅤㅤ۱۱۱۱۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㅤ۱۱۱۱۱۱۱۱ㅤㅤㅤㅤ۱۱۱۱۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤ۱۱۱۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱۱۱۱۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤ۱۱۱۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱۱۱۱۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤ۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤ۱۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤщеㅤсеㅤпостроиㅤдъгаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤщеㅤсеㅤпостроиㅤдъгаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤсㅤподреденатаㅤтъгаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤсㅤподреденатаㅤтъгаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤразрушенитеㅤосновиㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤразрушенитеㅤосновиㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤразпилянатаㅤнадеждаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤразпилянатаㅤнадеждаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㅤㅤㅤހㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤпроваленитеㅤлюбовиㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㅤㅤㅤހㅤㅤㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤпроваленитеㅤлюбовиㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤހㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤЛуㅤстарателноㅤподреждаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤހㅤㅤ۱ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤЛуㅤстарателноㅤподреждаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ㅤㅤܢㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ㅤㅤܢㅤㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤଡ଼ଡ଼١ㅤㅤㅤ__ㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ_________________________________ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤଡ଼ଡ଼١ㅤㅤㅤ__ㅤㅤㅤހㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ_________________________________ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㄑ١ㅤㅤㅤㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤиㅤкакㅤсеㅤправиㅤдъгаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㄑ١ㅤㅤㅤㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤиㅤкакㅤсеㅤправиㅤдъгаㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ㅤ0ㅤㅤㅤ0ㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㄑ١ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤЛулуㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ㅤ0ㅤㅤㅤ0ㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㄑ١ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤЛулуㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㄑଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㄑଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤااㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤااㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤااㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤااㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤااㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤااㅤㅤㅤଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ଡ଼ㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤااㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤɭㅤﾉㅤㅤㅤㅤㅤㅤㅤㅤㅤɭㅤﾉㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤɭㅤﾉㅤㅤㅤㅤㅤㅤㅤㅤㅤɭㅤﾉㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤ__UUUU___________________UUUU________ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤ__UUUU___________________UUUU________ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤ__________________________________________ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤ__________________________________________ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ();
        }
#line 1 ""
        private static void ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ()
        {
#line 1 ""
            throw new LuluIKakSePraviDagaException("С подредената тъга ще се построи дъга.");
        }
    }

    class LuluIKakSePraviDagaException : Exception
    {
        public LuluIKakSePraviDagaException(string message) : base(message) { }
    }
#pragma warning restore 1709 // warning CS1709: Filename specified for preprocessor directive is empty
// ReSharper restore InconsistentNaming
// ReSharper restore CheckNamespace
}